In [ ]:
import pandas as pd
import sqlite3

In [3]:
wikipedia = pd.read_excel("C:/Users/MQ/Documents/D.A/Data-Analytics-Course-Project-main/wikipedia_dataset_flat edit.xlsx", header=0)
wikipedia.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 549000 entries, 0 to 548999
Data columns (total 6 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      549000 non-null  int64
 1   date    549000 non-null  datetime64[ns]
 2   day     549000 non-null  object
 3   month   549000 non-null  object
 4   page    549000 non-null  object
 5   visits  548913 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 25.1+ MB

In [2]:
db_conn = sqlite3.connect("C:/Users/MQ/Documents/D.A/Data-Analytics-Course-Project-main/wikipedia.db")

In [3]:
c = db_conn.cursor()

In [46]:
wikipedia.columns

Index(['ID', 'date', 'day', 'month', 'page', 'visits'], dtype='object')

In [48]:
c.execute(
    """
    CREATE TABLE wikipedia (
        ID INTEGER,
        Date DATETIME,
        Day TEXT NOT NULL,
        Month TEXT NOT NULL,
        Page VARCHAR,
        Visits REAL,
        PRIMARY KEY(ID)
    );
    """
)

In [49]:

wikipedia.to_sql('wikipedia', db_conn, if_exists='append', index=False)

QUESTION (1a)

In [54]:
pd.read_sql(
    """
    SELECT Page, Visits 
    FROM wikipedia
    WHERE Date >= "2016-01-01" AND Date < "2016-01-02"
    ORDER BY Visits DESC
    LIMIT 10
    """
    , db_conn
    )

                                                Page      Visits
0   Main_Page_en.wikipedia.org_all-access_all-agents  16357307.0
1      Main_Page_en.wikipedia.org_desktop_all-agents   9170612.0
2   Main_Page_en.wikipedia.org_mobile-web_all-agents   6920930.0
3  Wikipedia:Hauptseite_de.wikipedia.org_all-acce...   3062989.0
4  Wikipedia:Hauptseite_de.wikipedia.org_mobile-w...   2306896.0
5  Special:Search_en.wikipedia.org_all-access_all...   1794204.0
6  WikipÃ©dia:Accueil_principal_fr.wikipedia.org_...   1532934.0
7  Special:Search_en.wikipedia.org_desktop_all-ag...   1401667.0
8  WikipÃ©dia:Accueil_principal_fr.wikipedia.org_...   1253720.0
9  Wikipedia:Portada_es.wikipedia.org_all-access_...   1214388.0

QUESTION (1b)

In [30]:
pd.read_sql(
    """
    SELECT Page, Visits 
    FROM wikipedia
    WHERE Date >= "2016-11-08" AND Date < "2016-11-09"
    ORDER BY Visits DESC
    LIMIT 10
    """
    , db_conn
    )

                                                Page      Visits
0   Main_Page_en.wikipedia.org_all-access_all-agents  24600978.0
1      Main_Page_en.wikipedia.org_desktop_all-agents  20367321.0
2   Main_Page_en.wikipedia.org_mobile-web_all-agents   4161059.0
3  Wikipedia:Hauptseite_de.wikipedia.org_all-acce...   2829085.0
4  Special:Search_en.wikipedia.org_all-access_all...   2246978.0
5  Wikipedia:Hauptseite_de.wikipedia.org_mobile-w...   1796959.0
6  Special:Search_en.wikipedia.org_desktop_all-ag...   1796203.0
7  WikipÃ©dia:Accueil_principal_fr.wikipedia.org_...   1464684.0
8  Ð—Ð°Ð³Ð»Ð°Ð²Ð½Ð°Ñ_ÑÑ‚Ñ€Ð°Ð½Ð¸Ñ†Ð°_ru.wikiped...   1379041.0
9  Wikipedia:Portada_es.wikipedia.org_all-access_...   1182277.0

QUESTION 4

In [5]:
pd.read_sql(
    """
    SELECT COUNT(DISTINCT(Page)) as Chinese
    FROM wikipedia
    WHERE Page LIKE "%_zh.%"
    """
    ,db_conn
)

   Chinese
0       31

In [42]:
pd.read_sql(
    """
    SELECT COUNT(DISTINCT(Page)) as Eng
    FROM wikipedia
    WHERE Page LIKE "%_en.%"
    """
    ,db_conn
)

    Eng
0  1143

In [43]:
pd.read_sql(
    """
    SELECT COUNT(DISTINCT(Page)) as French
    FROM wikipedia
    WHERE Page LIKE "%_fr.%"
    """
    ,db_conn
)

   French
0      34

In [4]:
pd.read_sql(
    """
    SELECT COUNT(DISTINCT(Page)) as Germany
    FROM wikipedia
    WHERE Page LIKE "%_de.%"
    """
    ,db_conn
)

   Germany
0       39

In [6]:
pd.read_sql(
    """
    SELECT COUNT(DISTINCT(Page)) as Japanese
    FROM wikipedia
    WHERE Page LIKE "%_ja.%"
    """
    ,db_conn
)

   Japanese
0       121

In [8]:
pd.read_sql(
    """
    SELECT COUNT(DISTINCT(Page)) as Russian
    FROM wikipedia
    WHERE Page LIKE "%_ru.%"
    """
    ,db_conn
)

   Russian
0       36

In [7]:
pd.read_sql(
    """
    SELECT COUNT(DISTINCT(Page)) as Spanish
    FROM wikipedia
    WHERE Page LIKE "%_es.%"
    """
    ,db_conn
)

   Spanish
0       79

In [11]:
pd.read_sql(
    """
    SELECT
        (SELECT COUNT(DISTINCT(Page)) FROM wikipedia WHERE Page LIKE "%_zh.%") as Chinese,
        (SELECT COUNT(DISTINCT(Page)) FROM wikipedia WHERE Page LIKE "%_en.%") as English,
        (SELECT COUNT(DISTINCT(Page)) FROM wikipedia WHERE Page LIKE "%_fr.%") as French,
        (SELECT COUNT(DISTINCT(Page)) FROM wikipedia WHERE Page LIKE "%_de.%") as Germany,
        (SELECT COUNT(DISTINCT(Page)) FROM wikipedia WHERE Page LIKE "%_ja.%") as Japanese,
        (SELECT COUNT(DISTINCT(Page)) FROM wikipedia WHERE Page LIKE "%_ru.%") as Russian,
        (SELECT COUNT(DISTINCT(Page)) FROM wikipedia WHERE Page LIKE "%_es.%") as Spanish
    FROM wikipedia
    LIMIT 1
    """
    ,db_conn
)

   Chinese  English  French  Germany  Japanese  Russian  Spanish
0       31     1143      34       39       121       36       79

QUESTION 5

In [30]:
pd.read_sql(
    """
    SELECT Day, SUM(Visits) as Frequency
    FROM wikipedia
    GROUP BY Day
    ORDER BY 2 DESC
    """
    ,db_conn
)

         Day     Frequency
0     Monday  4.904875e+09
1    Tuesday  4.756254e+09
2  Wednesday  4.676263e+09
3   Thursday  4.571745e+09
4     Sunday  4.551448e+09
5   Saturday  4.470286e+09
6     Friday  4.409638e+09

QUESTION 6

In [31]:
pd.read_sql(
    """
    SELECT Day, SUM(Visits) as Frequency
    FROM wikipedia
    GROUP BY Day
    ORDER BY 2
    """
    ,db_conn
)

         Day     Frequency
0     Friday  4.409638e+09
1   Saturday  4.470286e+09
2     Sunday  4.551448e+09
3   Thursday  4.571745e+09
4  Wednesday  4.676263e+09
5    Tuesday  4.756254e+09
6     Monday  4.904875e+09

QUESTION 7

In [37]:
pd.read_sql(
    """
    SELECT SUM(Visits) as Mobile
    FROM wikipedia
    WHERE Page LIKE "%_mobile%"
    """
    ,db_conn
)

         Mobile
0  4.631942e+09

In [38]:
pd.read_sql(
    """
    SELECT SUM(Visits) as Desktop
    FROM wikipedia
    WHERE Page LIKE "%_desktop%"
    """
    ,db_conn
)

        Desktop
0  1.025762e+10

In [39]:
pd.read_sql(
    """
    SELECT
        (SELECT SUM(Visits) FROM wikipedia WHERE Page LIKE "%_mobile%") as Mobile,
        (SELECT SUM(Visits) FROM wikipedia WHERE Page LIKE "%_desktop%") as Desktop
    FROM wikipedia
    LIMIT 1
    """
    ,db_conn
)

         Mobile       Desktop
0  4.631942e+09  1.025762e+10